app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $guestModel = new GuestModel();
        $requestModel = new ServiceRequestModel();

        $data = [
            'total_guests' => $guestModel->countAll(),
            'checked_in_guests' => $guestModel->where('status', 'checked_in')->countAllResults(),
            'total_requests' => $requestModel->countAll(),
            'pending_requests' => $requestModel->where('status', 'pending')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `status` = 'checked_in'
SELECT COUNT(*) AS `numrows` FROM `service_requests`
SELECT COUNT(*) AS `numrows`
FROM `service_requests`
WHERE `status` = 'pending'