app/Controllers/Admin/GuestsController.php

SELECT *
FROM `guests`
---
    public function index()
    {
        $model = new GuestModel();
        $guests = $model->findAll();

DELETE FROM `guests`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $guestModel = new \App\Models\GuestModel();
        $guestModel->delete($id);