app/Controllers/Admin/RequestsController.php

SELECT *
FROM `service_requests`
---
    public function index()
    {
        $model = new ServiceRequestModel();
        $requests= $model->findAll();

SELECT *
FROM `guests`
SELECT *
FROM `users`
---
    public function create()
    {
        $guestModel = new GuestModel();
        $userModel = new UserModel();

        $guests = $guestModel->findAll();  // For guest dropdown
        $users = $userModel->findAll();    // For assigned user dropdown

SELECT *
FROM `service_requests`
WHERE `service_requests`.`id` = '3'
---
    public function edit($id)
    {
        $model = new ServiceRequestModel();
        $request = $model->find($id);