app/Controllers/AuthController.php

    public function home()
    {
        $guestModel = new GuestModel();
        $ServiceModel = new ServiceRequestModel();
        $guests = $guestModel->findAll();  // For guest dropdown
        $requests = $ServiceModel->findAll();    // For assigned user dropdown
---
SELECT *
FROM `guests`
SELECT *
FROM `service_requests`