app/Models/GuestModel.php

    public static function getGuestName($id)
    {
        $model = new GuestModel(); // Instantiate the model

        $user = $model->where(['id' => $id])->first(); // Use 'first()' instead of 'one()'
---
SELECT *
FROM `guests`
WHERE `id` = '2'
 LIMIT 1

    public static function getGuestRoom($id)
    {
        $model = new GuestModel(); // Instantiate the model
        $user = $model->where(['id' => $id])->first(); // Use 'first()' instead of 'one()'
---
SELECT *
FROM `guests`
WHERE `id` = '2'
 LIMIT 1