app/Models/ServiceRequestModel.php

    public static function getService($id)
    {
        $model = new ServiceRequestModel(); // Instantiate the model
        $user = $model->where(['id' => $id])->first(); // Use 'first()' instead of 'one()'
---
SELECT *
FROM `service_requests`
WHERE `id` = '5'
 LIMIT 1

    public static function getServiceStatus($id)
    {
        $model = new ServiceRequestModel(); // Instantiate the model
        $user = $model->where(['id' => $id])->first(); // Use 'first()' instead of 'one()'
---
SELECT *
FROM `service_requests`
WHERE `id` = '5'
 LIMIT 1